app/views/students/new.html.erb

SELECT "courses".* FROM "courses"
---
<h1>New Student</h1>
<% courses = Course.all.map { |course| [course.name, course.id] } %>