app/controllers/courses_controller.rb

    def create
        @course = Course.new(course_params)

        respond_to do |format|
            if @course.save
---
INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Linear Algebra"], ["created_at", "2022-02-24 07:27:41.735065"], ["updated_at", "2022-02-24 07:27:41.735065"]]